In [1]:
import numpy as np
import pandas as pd

In [2]:
#处理缺失值
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])

data.dropna()
#dropna直接丢弃缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
#对于DataFrame来说dropna会直接删去一行
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [4]:
cleaned = data.dropna()

In [5]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [6]:
data.dropna(how = 'all')#会删除全为na的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [7]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [8]:
data.dropna(axis = 1,how = 'all')#加入列参数则会删除全为na的列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [4]:
df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4,1] = NA
df.iloc[:2,2] = NA

df

          0         1         2
0 -0.420833       NaN       NaN
1 -0.590158       NaN       NaN
2 -0.459441       NaN -1.300609
3 -0.663988       NaN -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [5]:
df.dropna()

          0         1         2
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [6]:
df.dropna(thresh = 2)#过滤条件

          0         1         2
2 -0.459441       NaN -1.300609
3 -0.663988       NaN -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [7]:
#补全缺失值
#调用fillna时使用字典，可以为不同列设定不同的填充值

df.fillna({1:0.5,2:0})

          0         1         2
0 -0.420833  0.500000  0.000000
1 -0.590158  0.500000  0.000000
2 -0.459441  0.500000 -1.300609
3 -0.663988  0.500000 -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [8]:
df

          0         1         2
0 -0.420833       NaN       NaN
1 -0.590158       NaN       NaN
2 -0.459441       NaN -1.300609
3 -0.663988       NaN -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [9]:
df.fillna(0,inplace  = False)

          0         1         2
0 -0.420833  0.000000  0.000000
1 -0.590158  0.000000  0.000000
2 -0.459441  0.000000 -1.300609
3 -0.663988  0.000000 -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [10]:
df

          0         1         2
0 -0.420833       NaN       NaN
1 -0.590158       NaN       NaN
2 -0.459441       NaN -1.300609
3 -0.663988       NaN -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [13]:
df.fillna(method = 'bfill',limit = 2)#向上填充，范围为2

          0         1         2
0 -0.420833       NaN -1.300609
1 -0.590158       NaN -1.300609
2 -0.459441  0.557922 -1.300609
3 -0.663988  0.557922 -1.121517
4  1.355428  0.557922 -1.393555
5 -0.212594 -0.049591  1.997433
6 -2.017445  0.372586  0.493832

In [14]:
#数据转换
#删除重复值
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [15]:
data.duplicated()#每行的值是否存在与之前行重复

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [17]:
data.drop_duplicates()#删除重复行，也就是False对象

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [19]:
#这些操作都是默认对列操作
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [20]:
data.drop_duplicates(['k1'])#删除K1中重复出现的值所在行

    k1  k2  v1
0  one   1   0
1  two   1   1

In [21]:
#这两个参数都是默认保留第一次观测到的值
data.drop_duplicates(['k1','k2'],keep= 'last')#删除k1,k2重复出现的行，并且是倒序

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [22]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [29]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [30]:
data['animal'] = lowercased.map(meat_to_animal)
#map接受一个包含映射关系的字典对象，map的作用就是做映射
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [32]:
#也可以直接传入一个能完成所有工作的函数
data['food'].map(lambda x: meat_to_animal[x.lower()])#将括号内的匿名函数应用于food这一列

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [33]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
#替代值
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
#重命名轴索引
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
transform = lambda x:x[:4].upper()

In [44]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [45]:
data.index  = data.index.map(transform)

In [46]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
#c创建数据集转换后的新版本并且不修改原有的数据集、

data.rename(index = str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
#rename可以结合字典型对象使用，赋值
data.rename(index = {'OHIO':'INDIANA'},columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
data.rename(index = {'OHIO':'INDIANA'},columns = {'three':'peekaboo'},inplace = True)

In [51]:
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
#离散化和分箱

ages = [20,22,25,27,21,23,37,31,61,45,41,32]

bins = [18,25,35,60,100]

cats = pd.cut(ages,bins)

In [53]:
cats#相当于分出了四种12个箱子

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [56]:
pd.value_counts(cats)#对每种箱数量的计数

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [57]:
#可以向labels选项传入列表或数组来自定义箱名

group_names = ['Youth','YoungAdult','MiddleAged','Senior']

pd.cut(ages,bins,labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [58]:
data = np.random.rand(20)

In [60]:
pd.cut(data,4,precision = 2) #将十进制精度限制在两位

[(0.698, 0.923], (0.474, 0.698], (0.698, 0.923], (0.25, 0.474], (0.0245, 0.25], ..., (0.0245, 0.25], (0.0245, 0.25], (0.25, 0.474], (0.0245, 0.25], (0.25, 0.474]]
Length: 20
Categories (4, interval[float64, right]): [(0.0245, 0.25] < (0.25, 0.474] < (0.474, 0.698] < (0.698, 0.923]]

In [62]:
#qcut将数据切成等长的份数，每一份的样本数不一定相同

data = np.random.randn(1000)

cats = pd.qcut(data,4)

cats

[(-3.55, -0.696], (-3.55, -0.696], (0.706, 3.475], (-3.55, -0.696], (-0.0173, 0.706], ..., (-0.696, -0.0173], (0.706, 3.475], (-0.696, -0.0173], (-0.0173, 0.706], (-0.0173, 0.706]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.55, -0.696] < (-0.696, -0.0173] < (-0.0173, 0.706] < (0.706, 3.475]]

In [64]:
pd.value_counts(cats)

(-3.55, -0.696]      250
(-0.696, -0.0173]    250
(-0.0173, 0.706]     250
(0.706, 3.475]       250
dtype: int64

In [66]:
dogs = pd.qcut(data,[0,0.1,0.5,0.9,1.])#这里传入的自定义分位数是指把数据按照1：4：4：1不等均分，而不是规定了边界的具体数值

In [68]:
dogs

[(-1.31, -0.0173], (-3.55, -1.31], (1.268, 3.475], (-1.31, -0.0173], (-0.0173, 1.268], ..., (-1.31, -0.0173], (1.268, 3.475], (-1.31, -0.0173], (-0.0173, 1.268], (-0.0173, 1.268]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.55, -1.31] < (-1.31, -0.0173] < (-0.0173, 1.268] < (1.268, 3.475]]

In [67]:
pd.value_counts(dogs)

(-1.31, -0.0173]    400
(-0.0173, 1.268]    400
(-3.55, -1.31]      100
(1.268, 3.475]      100
dtype: int64

In [85]:
#检测和过滤异常值
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.029608     0.012768    -0.030194    -0.008856
std       1.013776     0.987588     1.009181     0.959519
min      -3.398652    -3.347257    -3.188303    -2.921885
25%      -0.653360    -0.678194    -0.700368    -0.618575
50%      -0.008335    -0.008384    -0.040424    -0.013186
75%       0.737217     0.718010     0.685289     0.605956
max       3.076083     3.165074     2.935045     3.143278

In [86]:
col = data[2]

col[np.abs(col) > 3]
#得到第二列中绝对值大于三的值

586   -3.001527
801   -3.188303
Name: 2, dtype: float64

In [87]:
data[(np.abs(data)>3).any(1)]#选出所有存在绝对值大于3的数值所在的行 any是指在轴向上只要存在一个为真就返回

#在标准正态分布中，绝大部分数值的绝对值都小于四

            0         1         2         3
10  -3.270361 -0.312546  0.148331 -0.590173
37   0.057159 -3.347257 -1.658363 -0.852023
70  -3.398652 -0.320053 -0.207872 -0.651272
299 -1.009449  0.709464  1.746058  3.124719
397  3.076083 -0.000486 -0.362538 -0.773843
419 -0.756396 -1.297309  1.168187  3.143278
483 -0.049726 -0.025329 -0.526850  3.036104
586  0.910102 -0.070728 -3.001527 -1.004228
801 -1.356783 -0.893181 -3.188303  1.966661
905 -0.867193  3.165074 -1.420303  0.088664

In [97]:
data[np.abs(data)>3] = np.sign(data)*3
#np.sign将所有符合要求的数字变成1或
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.030201     0.012950    -0.030004    -0.009160
std       1.011431     0.985952     1.008604     0.958544
min      -3.000000    -3.000000    -3.000000    -2.921885
25%      -0.653360    -0.678194    -0.700368    -0.618575
50%      -0.008335    -0.008384    -0.040424    -0.013186
75%       0.737217     0.718010     0.685289     0.605956
max       3.000000     3.000000     2.935045     3.000000

In [91]:
np.sign(data).head()#读取前五行

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

In [98]:
#置换和随机抽样
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

sampler = np.random.permutation(5)#根据指定长度随即重排序

sampler

array([2, 0, 1, 4, 3])

In [100]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [101]:
df.take(sampler)#行重排列

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [102]:
#选出不含替代值的随即子集

df.sample(n = 3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [109]:
#选出含有替代值的随机子集

choices = pd.Series([5,7,-1,6,4])

draws = choices.sample(n = 4 ,replace = True) #长度为4 True代表可以选择重复值，False不重复，但长度不能大于原始长度


draws

3    6
2   -1
2   -1
0    5
dtype: int64

In [1]:
#计算指标/虚拟标量

import pandas as pd
import numpy as np

df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [2]:
pd.get_dummies(df['key'])# key列存在三个不同的值生成三列0，1，对应在原始data中三个值对应的位置

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [3]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [5]:
dummies = pd.get_dummies(df['key'],prefix = 'key')  #前缀是key

df_with_dummy = df[['data1']].join(dummies) #join让两个数据合并

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [9]:
#导入IM数据集
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

D:\miniconda\envs\d2l-zh\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [11]:
#提取所有的流派分类

all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)

In [12]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [21]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [28]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|')) #get_indexer是前者元素在后者对应的映射序号

array([0, 1, 2], dtype=int64)

In [18]:
gen

"Animation|Children's|Comedy"

In [25]:
enumerate(movies.genres)

pd.DataFrame(enumerate(movies.genres))

         0                             1
0        0   Animation|Children's|Comedy
1        1  Adventure|Children's|Fantasy
2        2                Comedy|Romance
3        3                  Comedy|Drama
4        4                        Comedy
...    ...                           ...
3878  3878                        Comedy
3879  3879                         Drama
3880  3880                         Drama
3881  3881                         Drama
3882  3882                Drama|Thriller

[3883 rows x 2 columns]

In [30]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [31]:
dummies.iloc[i,indices]

Drama       1.0
Thriller    1.0
Name: 3882, dtype: float64

In [32]:
#将结果与movies联合

movies_windic = movies.join(dummies.add_prefix('Genr_'))

movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genr_Animation                              1.0
Genr_Children's                             1.0
Genr_Comedy                                 1.0
Genr_Adventure                              0.0
Genr_Fantasy                                0.0
Genr_Romance                                0.0
Genr_Drama                                  0.0
Genr_Action                                 0.0
Genr_Crime                                  0.0
Genr_Thriller                               0.0
Genr_Horror                                 0.0
Genr_Sci-Fi                                 0.0
Genr_Documentary                            0.0
Genr_War                                    0.0
Genr_Musical                                0.0
Genr_Mystery                                0.0
Genr_Film-Noir                              0.0
Genr_Western                                0.0
Name: 0, dtype: object

In [34]:
#对于更大的数据，更好的方法是写一个直接将数据写为NUMPY数组的底层函数，将结果封装入Data


np.random.seed(12345)  #改变随机生成的种子数
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [35]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins)) #独热

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [40]:
#字符串操作
val = 'a,b,  guido'

val.split(',')

['a', 'b', '  guido']

In [42]:
#split和strip一起用，用于清除空格
pieces = [x.strip() for x in val.split(',')] #strip() 方法用于移除字符串头尾指定的字符（默认为空格）
pieces

['a', 'b', 'guido']

In [43]:
first,second,third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [44]:
'::'.join(pieces)

'a::b::guido'

In [45]:
val.index(',')

1

In [46]:
val.find(':')#.find找不到对象时会返回-1，index会报错

-1

In [47]:
val.count(',')#出现的次数

2

In [48]:
val.replace(',','::') #符号替换

'a::b::  guido'

In [8]:
#正则表达式
import re

text = "foo   bar\t baz  \tqux"

re.split('\s+',text)  #\s+的作用是描述一个或多个空白字符

['foo', 'bar', 'baz', 'qux']

In [9]:
#可以自行编译，形成可反复使用的正则表达式对象

regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [10]:
regex.findall(text)  #findall得到正则表达式匹配到的所有结果

['   ', '\t ', '  \t']

In [11]:
#识别大部分电子邮件地址

text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}' #检查邮箱地址

# re.IGNORECASE 使正则表达式不区分大小写
regex = re.compile(pattern, flags=re.IGNORECASE)

In [12]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [13]:
m = regex.search(text)

m#search得到第一个匹配到的电子邮件地址，以及位置

In [14]:
text[m.start():m.end()]#得到第一个电邮

'dave@google.com'

In [15]:
print(regex.match(text))#match只在模式出现于字符串起始位置才能匹配到

None

In [16]:
print(regex.sub('REDACTED',text))#sub返回一个新的字符串，源字符串中被抓取的对象会被代替

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [17]:
#将电邮地址分为三个部分：用户名，域名，域名后缀
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

m = regex.match('wesm@bright.net')

In [18]:
m.groups()

('wesm', 'bright', 'net')

In [19]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [20]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text)) #\n代表访问第几个匹配的分组

Dave Username:dave,Domain:google,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

In [21]:
#pandas中的向量化字符串函数
import pandas as pd
import numpy as np

data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

data = pd.Series(data)

data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [22]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [23]:
data.str.contains('com')#检测是否包含某个字符，返回布尔值

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [24]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [25]:
x = data.str.findall(pattern,flags = re.IGNORECASE)
x

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [26]:
matches1 = data.str.match(pattern,flags = re.IGNORECASE)
matches1

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [27]:
matches1.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [28]:
x.str[0]

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [30]:
#也可以使用字符串切片

data.str[:4]

Dave     dave
Steve    stev
Rob      rob@
Wes       NaN
dtype: object

In [31]:
#数据规整：连接，联合与重塑
data = pd.Series(np.random.randn(9),index = [['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

data

a  1    0.468186
   2   -1.697109
   3   -2.017795
b  1    0.012555
   3    0.322837
c  1    0.390765
   2   -0.389777
d  2    0.050113
   3   -0.131384
dtype: float64

In [32]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [33]:
data['b']

1    0.012555
3    0.322837
dtype: float64

In [34]:
data['b':'c']

b  1    0.012555
   3    0.322837
c  1    0.390765
   2   -0.389777
dtype: float64

In [35]:
data.loc[['b','d']]

b  1    0.012555
   3    0.322837
d  2    0.050113
   3   -0.131384
dtype: float64

In [49]:
data.loc[:,2]

a   -1.697109
c   -0.389777
d    0.050113
dtype: float64

In [50]:
data.unstack()  #将数据在DataFrame中重新排列

          1         2         3
a  0.468186 -1.697109 -2.017795
b  0.012555       NaN  0.322837
c  0.390765 -0.389777       NaN
d       NaN  0.050113 -0.131384

In [51]:
data.unstack().stack()   #unstack的反操作

a  1    0.468186
   2   -1.697109
   3   -2.017795
b  1    0.012555
   3    0.322837
c  1    0.390765
   2   -0.389777
d  2    0.050113
   3   -0.131384
dtype: float64

In [52]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),index = [['a','a','b','b'],[1,2,1,2]],columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [53]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [55]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']

In [56]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [57]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [66]:
frame.swaplevel('key1','key2')  #swaplevel将层级顺序变更，但数据不变,

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [61]:
frame.sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [62]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [64]:
frame.swaplevel(0,1).sort_index(level =0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [67]:
frame.sum(level = 'key2')

C:\Users\GRIMMO~1\AppData\Local\Temp/ipykernel_18772/958648635.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [83]:
frame.sum(level = 'key1')

C:\Users\GRIMMO~1\AppData\Local\Temp/ipykernel_18772/2076038986.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = 'key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [78]:
frame.sum(level = 'color',axis = 1)  #分别对GREEN和RED

C:\Users\GRIMMO~1\AppData\Local\Temp/ipykernel_18772/630364659.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level = 'color',axis = 1)  #分别对GREEN和RED

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [84]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [88]:
frame2 = frame.set_index(['c','d'])  #生成一个新的Data，使用一个或多个列作为索引

frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [89]:
frame.set_index(['c','d'],drop = False)#保留新的索引

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [90]:
frame2.reset_index() #反向操作索引层级会被移动到列中

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [91]:
#联合与合并数据集
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

df2 = pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [92]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [93]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [95]:
pd.merge(df1,df2)  #粘合后取两者都有的key key的数量是笛卡尔积，df1中有三个b，df2中有一个b，结果中有三个b

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [104]:
pd.merge(df2,df1,on = 'key') #on代表需要链接的列名，必须是两边都有的

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [99]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

df4 = pd.DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [100]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [101]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [103]:
pd.merge(df3,df4,left_on = 'lkey',right_on = 'rkey')  #若没有相同的key，就必须指定key

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [105]:
#outer是键的并集,默认是inner，交集
pd.merge(df1,df2,how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [106]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
df2 = pd.DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [107]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [108]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [115]:
pd.merge(df1,df2,on = 'key',how = 'right')#对所有右表的键进行联合

   key  data1  data2
0    a    2.0      0
1    a    4.0      0
2    b    0.0      1
3    b    1.0      1
4    b    5.0      1
5    a    2.0      2
6    a    4.0      2
7    b    0.0      3
8    b    1.0      3
9    b    5.0      3
10   d    NaN      4

In [111]:
pd.merge(df1,df2,on = 'key',how = 'left')#对所有左表的键进行联合

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [117]:
pd.merge(df1,df2,how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [134]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [119]:
#处理重叠的列名，前面在（重命名轴标签）

pd.merge(left,right,on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [120]:
pd.merge(left,right,on = 'key1',suffixes = ('_left','_right'))  #suffixes添加后缀

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [121]:
#根据索引合并
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

right1 = pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [122]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [123]:
right1

   group_val
a        3.5
b        7.0

In [126]:
pd.merge(left1,right1,left_on='key',right_index=True)#因为在right中用于合并的键key是他的index，所以必须添加righ_index

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [128]:
pd.merge(left1,right1,left_on = 'key',right_index = True,how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [129]:
#多层索引
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [130]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [131]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [132]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index = True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [135]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index = True,how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [136]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [137]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [138]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [140]:
pd.merge(left2,right2,how = 'outer',left_index = True,right_index = True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [141]:
left2.join(right2,how = 'outer')  #join可以起到相同效果，但要求没有重叠列

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [142]:
right2.join(left2,how = 'outer')

   Missouri  Alabama  Ohio  Nevada
a       NaN      NaN   1.0     2.0
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [143]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [144]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])

In [145]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [146]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [147]:
left2.join([right2,another],how = 'outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

In [1]:
#沿轴向进行连接
import numpy as np
import pandas as pd

arr = np.arange(12).reshape((3,4))

In [2]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [3]:
np.concatenate([arr,arr],axis = 1)#利用concatenate进行拼接

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [5]:
np.concatenate([arr,arr],axis = 0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [7]:
np.concatenate([arr,arr,arr],axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11,  8,  9, 10, 11]])

In [9]:
s1 = pd.Series([0,1],index = ['a','b'])
s2 = pd.Series([2,3,4],index = ['c','d','e'])
s3 = pd.Series([5,6], index = ['f','g'])

In [11]:
#三个索引存在不重叠的series
pd.concat([s1,s2,s3])
#自动结合

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [12]:
pd.concat([s1,s1,s2])

a    0
b    1
a    0
b    1
c    2
d    3
e    4
dtype: int64

In [13]:
pd.concat([s1,s2,s3],axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [15]:
s4 = pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [16]:
pd.concat([s1,s4],axis = 1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [17]:
pd.concat([s1,s4],axis = 1,join = 'inner')#加入inner选项后，默认取交集

   0  1
a  0  0
b  1  1

In [18]:
#可以指定其他连接轴

In [28]:
result = pd.concat([s1,s1,s3],keys = ['ones','two','three'])

result

ones   a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [30]:
result.unstack()

         a    b    f    g
ones   0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [31]:
pd.concat([s1,s2,s3],axis = 1,keys = ['one','two','three'])
#keys成为列头

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [32]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [33]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [34]:
df2

   three  four
a      5     6
c      7     8

In [35]:
pd.concat([df1,df2],axis = 1,keys = ['level1','level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [36]:
#也可以用字典的形式传递
pd.concat({'level1':df1,'level2':df2},axis = 1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [39]:
pd.concat([df1,df2],axis = 1,keys = ['level1','level2'],names = ['upper','lower'])  #命名多层轴层级

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [40]:
#行索引中不包含任何相关数据
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [41]:
df1

          a         b         c         d
0 -1.245424 -0.010331  0.298133 -0.008607
1  1.597950 -0.238223 -0.206374 -1.356307
2  0.828315 -0.387841  0.698325  0.671239

In [42]:
df2

          b         d         a
0  1.799080 -0.212135  1.330706
1 -2.137443 -0.292507 -0.271900

In [45]:
pd.concat([df1,df2])#直接链接会保留原来的索引

          a         b         c         d
0 -1.245424 -0.010331  0.298133 -0.008607
1  1.597950 -0.238223 -0.206374 -1.356307
2  0.828315 -0.387841  0.698325  0.671239
0  1.330706  1.799080       NaN -0.212135
1 -0.271900 -2.137443       NaN -0.292507

In [48]:
pd.concat([df1,df2],ignore_index=True)  #忽略原来的索引，生成新的索引

          a         b         c         d
0 -1.245424 -0.010331  0.298133 -0.008607
1  1.597950 -0.238223 -0.206374 -1.356307
2  0.828315 -0.387841  0.698325  0.671239
3  1.330706  1.799080       NaN -0.212135
4 -0.271900 -2.137443       NaN -0.292507

In [49]:
#联合重叠数据
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [50]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [51]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [52]:
np.where(pd.isnull(a),b,a)#满足条件(condition)，输出x，不满足输出y

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

In [53]:
#where用法：两个数据集的索引有重叠，如A和B重叠部分选择有值的一边，是if-else的等价操作

In [54]:
b.combine_first(a)  #根据传入的对象修补调用对象的缺失值

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [55]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [56]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [57]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [58]:
df1.combine_first(df2) #根据传入的对象修补调用对象的缺失值,同时做链接

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [68]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=['Ohio', 'Colorado'], 
                    columns=['one', 'two', 'three'])

In [70]:
data.index.name = 'state'

In [71]:
data.columns.name = 'number'

In [72]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [74]:
result = data.stack()#将列的数据透视到行
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [75]:
result.unstack() #将行的数据透视到列

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [78]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [79]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [80]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [82]:
data2 = pd.concat([s1,s2],keys = ['ones','two'])
data2

ones  a    0
      b    1
      c    2
      d    3
two   c    4
      d    5
      e    6
dtype: int64

In [83]:
data2.unstack()

        a    b    c    d    e
ones  0.0  1.0  2.0  3.0  NaN
two   NaN  NaN  4.0  5.0  6.0

In [84]:
data2.unstack().stack() #逆向操作默认丢弃缺失值

ones  a    0.0
      b    1.0
      c    2.0
      d    3.0
two   c    4.0
      d    5.0
      e    6.0
dtype: float64

In [86]:
data2.unstack().stack(dropna = False)

ones  a    0.0
      b    1.0
      c    2.0
      d    3.0
      e    NaN
two   a    NaN
      b    NaN
      c    4.0
      d    5.0
      e    6.0
dtype: float64

In [87]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [88]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [89]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [3]:
#将长透视为宽
data = pd.read_csv('examples/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [4]:
periods = pd.PeriodIndex(year = data.year,quarter = data.quarter,name = 'date') #联合多列形成时间格式

In [5]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
data = data.reindex(columns=columns)
data.index = periods.to_timestamp('D', 'end')
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [6]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [7]:
pivoted = ldata.pivot('date','item','value')#把同一个时间戳合为一列

pivoted.head()

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [8]:
pivoted[:15]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2
1960-06-30 23:59:59.999999999  0.14  2834.390    5.2
1960-09-30 23:59:59.999999999  2.70  2839.022    5.6
1960-12-31 23:59:59.999999999  1.21  2802.616    6.3
1961-03-31 23:59:59.999999999 -0.40  2819.264    6.8
1961-06-30 23:59:59.999999999  1.47  2872.005    7.0
1961-09-30 23:59:59.999999999  0.80  2918.419    6.8
1961-12-31 23:59:59.999999999  0.80  2977.830    6.2
1962-03-31 23:59:59.999999999  2.26  3031.241    5.6
1962-06-30 23:59:59.999999999  0.13  3064.709    5.5
1962-09-30 23:59:59.999999999  2.11  3093.047    5.6

In [9]:
import numpy as np
import pandas as pd

ldata['value2'] = np.random.randn(len(ldata))  #添加一列，保持原始长度

In [10]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.764158
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.907624
2 1959-03-31 23:59:59.999999999    unemp     5.800  1.929553
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.262842
4 1959-06-30 23:59:59.999999999     infl     2.340  0.552174
5 1959-06-30 23:59:59.999999999    unemp     5.100  1.653073
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -0.765538
7 1959-09-30 23:59:59.999999999     infl     2.740 -0.894447
8 1959-09-30 23:59:59.999999999    unemp     5.300  0.414129
9 1959-12-31 23:59:59.999999999  realgdp  2785.204 -1.948248

In [12]:
pivoted = ldata.pivot('date','item')  #同时排列两列数值

In [13]:
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.907624  0.764158
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.552174 -0.262842
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.894447 -0.765538
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.262727 -1.948248
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.325767  0.188543


item                              unemp
date
1959-03-31 23:59:59.999999999  1.929553
1959-06-30 23:59:59.999999999  1.653073
1959-09-30 23:59:59.999999999  0.414129
1959-12-31 23:59:59.999999999 -1.465163
1960-03-31 23:59:59.999999999  0.405102

In [14]:
#pivot等价于set_index创建分层索引然后unstack
#set_index把列转化为行索引
unstacked = ldata.set_index(['date','item']).unstack('item')

In [15]:
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.907624  0.764158
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  0.552174 -0.262842
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.894447 -0.765538
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.262727 -1.948248
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -0.325767  0.188543
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.194107  1.011063
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6  0.037381  0.107914


item                              unemp
date
1959-03-31 23:59:59.999999999  1.929553
1959-06-30 23:59:59.999999999  1.653073
1959-09-30 23:59:59.999999999  0.414129
1959-12-31 23:59:59.999999999 -1.465163
1960-03-31 23:59:59.999999999  0.405102
1960-06-30 23:59:59.999999999 -1.241821
1960-09-30 23:59:59.999999999 -1.434762

In [16]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [17]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [19]:
melted=pd.melt(df,['key'])  #必须指明分组指标

In [20]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [21]:
reshaped = melted.pivot('key','variable','value')

reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [22]:
reshaped.reset_index()#将数据回移一列

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [23]:
pd.melt(df,id_vars = ['key'],value_vars = ['A','B'])  #指定列的子集作为值列

#id_vars代表不需要被转换的列 #value_vars代表仅需要转换的列

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [24]:
pd.melt(df,value_vars = ['A','B','C'])
#不指定分类指标

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [25]:
pd.melt(df,value_vars = ['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6